{
  "format": "layers-model",
  "generatedBy": "TensorFlow.js tfjs-layers v4.15.0",
  "convertedBy": null,
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential",
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [null, 224, 224, 3],
            "dtype": "float32",
            "sparse": false,
            "ragged": false,
            "name": "input_1"
          }
        },
        {
          "class_name": "AveragePooling2D",
          "config": {
            "name": "avg_pool",
            "trainable": true,
            "dtype": "float32",
            "data_format": "channels_last",
            "pool_size": [224, 224],
            "padding": "valid",
            "strides": [224, 224]
          }
        },
        {
          "class_name": "Flatten",
          "config": {
            "name": "flatten",
            "trainable": true,
            "dtype": "float32"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense",
            "trainable": true,
            "dtype": "float32",
            "units": 5,
            "activation": "softmax",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          }
        }
      ]
    },
    "keras_version": "2.13.0",
    "backend": "tensorflow"
  },
  "weightsManifest": [
    {
      "paths": [
        "weights.bin"
      ],
      "weights": [
        {
          "name": "dense/kernel",
          "shape": [3, 5],
          "dtype": "float32"
        },
        {
          "name": "dense/bias",
          "shape": [5],
          "dtype": "float32"
        }
      ]
    }
  ],
  "trainingConfig": {
    "loss": "categoricalCrossentropy",
    "metrics": [
      "accuracy"
    ],
    "optimizer_config": {
      "class_name": "Adam",
      "config": {
        "name": "Adam",
        "learning_rate": 0.0010000000474974513,
        "beta_1": 0.8999999761581421,
        "beta_2": 0.9990000128746033,
        "decay": 0.0,
        "amsgrad": false
      }
    }
  }
}
